test/dummy/app/controllers/test_models_controller.rb

  def index
    @test_models = TestModel.all
---
SELECT "test_models".* FROM "test_models"

  def destroy
    @test_model.destroy
---
DELETE FROM "test_models" WHERE "test_models"."id" = ?  [["id", 980190962]]

  def set_test_model
    @test_model = TestModel.find(params[:id])
---
SELECT  "test_models".* FROM "test_models" WHERE "test_models"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]